app/controllers/produtos_controller.rb

INSERT INTO "produtos" ("nome", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "maquina de corta cabelo"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-04-04 14:45:26.902404"], ["updated_at", "2025-04-04 14:45:26.902404"]]
---
  def create
    @produto = Produto.new(produto_params)

    if @produto.save